# Задана натуральная степень k. Сформировать случайным образом список коэффициентов
# (значения от 0 до 100) многочлена и записать в файл многочлен степени k.
# Пример:
# k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0

from random import randint


k = int(input('Введите степень многочлена: '))
k1 = randint(0,101)
k2 = randint(0,101)
k3 = randint(0,101)
if (k1 > 0) and (k2 > 0) and (k3 > 0):
    print(k1,'* x ^',k,'+',k2,'* x ^',k - 1, '+', k3)
elif (k1 == 0) and (k2 > 0) and (k3 > 0):
    print(k2,'* x ^',k - 1, '+', k3)
elif (k2 == 0) and (k2 > 0) and (k3 > 0):
    print(k1,'* x ^',k,'+', k3)
elif (k3 == 0) and (k1 > 0) and (k2 > 0):
    print(k1,'* x ^',k,'+',k2,'* x ^',k - 1)
